vonKarman2D_cfMesh/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{

    emptyWalls
    {
        type        empty;
    }

    wall
    {
        type        zeroGradient;
    }

    inlet
    {
        type        zeroGradient;
    }

    outlet
    {
        type        totalPressure;
        p0          uniform 0.0;
        value       $internalField;
    }

    open
    {
        type        totalPressure;
        p0          uniform 0.0;
        value       $internalField;
    }

    open001
    {
        type        totalPressure;
        p0          uniform 0.0;
        value       $internalField;
    }

}

// ************************************************************************* //
